garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f46q24.inc
// Register: VDDIO2CON
#define VDDIO2CON VDDIO2CON
VDDIO2CON                                equ 010Dh
// bitfield definitions
VDDIO2CON_SEL_POSN                       equ 0000h
VDDIO2CON_SEL_POSITION                   equ 0000h
VDDIO2CON_SEL_SIZE                       equ 0004h
VDDIO2CON_SEL_LENGTH                     equ 0004h
VDDIO2CON_SEL_MASK                       equ 000Fh
VDDIO2CON_NOT_HYS_POSN                   equ 0004h
VDDIO2CON_NOT_HYS_POSITION               equ 0004h
VDDIO2CON_NOT_HYS_SIZE                   equ 0001h
VDDIO2CON_NOT_HYS_LENGTH                 equ 0001h
VDDIO2CON_NOT_HYS_MASK                   equ 0010h
VDDIO2CON_RDY_POSN                       equ 0005h
VDDIO2CON_RDY_POSITION                   equ 0005h
VDDIO2CON_RDY_SIZE                       equ 0001h
VDDIO2CON_RDY_LENGTH                     equ 0001h
VDDIO2CON_RDY_MASK                       equ 0020h
VDDIO2CON_LVDSTAT_POSN                   equ 0006h
VDDIO2CON_LVDSTAT_POSITION               equ 0006h
VDDIO2CON_LVDSTAT_SIZE                   equ 0001h
VDDIO2CON_LVDSTAT_LENGTH                 equ 0001h
VDDIO2CON_LVDSTAT_MASK                   equ 0040h
VDDIO2CON_NOT_IOMON_POSN                 equ 0007h
VDDIO2CON_NOT_IOMON_POSITION             equ 0007h
VDDIO2CON_NOT_IOMON_SIZE                 equ 0001h
VDDIO2CON_NOT_IOMON_LENGTH               equ 0001h
VDDIO2CON_NOT_IOMON_MASK                 equ 0080h
VDDIO2CON_SEL0_POSN                      equ 0000h
VDDIO2CON_SEL0_POSITION                  equ 0000h
VDDIO2CON_SEL0_SIZE                      equ 0001h
VDDIO2CON_SEL0_LENGTH                    equ 0001h
VDDIO2CON_SEL0_MASK                      equ 0001h
VDDIO2CON_SEL1_POSN                      equ 0001h
VDDIO2CON_SEL1_POSITION                  equ 0001h
VDDIO2CON_SEL1_SIZE                      equ 0001h
VDDIO2CON_SEL1_LENGTH                    equ 0001h
VDDIO2CON_SEL1_MASK                      equ 0002h
VDDIO2CON_SEL2_POSN                      equ 0002h
VDDIO2CON_SEL2_POSITION                  equ 0002h
VDDIO2CON_SEL2_SIZE                      equ 0001h
VDDIO2CON_SEL2_LENGTH                    equ 0001h
VDDIO2CON_SEL2_MASK                      equ 0004h
VDDIO2CON_SEL3_POSN                      equ 0003h
VDDIO2CON_SEL3_POSITION                  equ 0003h
VDDIO2CON_SEL3_SIZE                      equ 0001h
VDDIO2CON_SEL3_LENGTH                    equ 0001h
VDDIO2CON_SEL3_MASK                      equ 0008h
VDDIO2CON_nHYS_POSN                      equ 0004h
VDDIO2CON_nHYS_POSITION                  equ 0004h
VDDIO2CON_nHYS_SIZE                      equ 0001h
VDDIO2CON_nHYS_LENGTH                    equ 0001h
VDDIO2CON_nHYS_MASK                      equ 0010h
VDDIO2CON_nIOMON_POSN                    equ 0007h
VDDIO2CON_nIOMON_POSITION                equ 0007h
VDDIO2CON_nIOMON_SIZE                    equ 0001h
VDDIO2CON_nIOMON_LENGTH                  equ 0001h
VDDIO2CON_nIOMON_MASK                    equ 0080h

// Register: ADCG1A
#define ADCG1A ADCG1A
ADCG1A                                   equ 0110h
// bitfield definitions
ADCG1A_CGA0_POSN                         equ 0000h
ADCG1A_CGA0_POSITION                     equ 0000h
ADCG1A_CGA0_SIZE                         equ 0001h
ADCG1A_CGA0_LENGTH                       equ 0001h
ADCG1A_CGA0_MASK                         equ 0001h
ADCG1A_CGA1_POSN                         equ 0001h
ADCG1A_CGA1_POSITION                     equ 0001h
ADCG1A_CGA1_SIZE                         equ 0001h
ADCG1A_CGA1_LENGTH                       equ 0001h
ADCG1A_CGA1_MASK                         equ 0002h
ADCG1A_CGA2_POSN                         equ 0002h
ADCG1A_CGA2_POSITION                     equ 0002h
ADCG1A_CGA2_SIZE                         equ 0001h
ADCG1A_CGA2_LENGTH                       equ 0001h
ADCG1A_CGA2_MASK                         equ 0004h
ADCG1A_CGA3_POSN                         equ 0003h
ADCG1A_CGA3_POSITION                     equ 0003h
ADCG1A_CGA3_SIZE                         equ 0001h
ADCG1A_CGA3_LENGTH                       equ 0001h
ADCG1A_CGA3_MASK                         equ 0008h
ADCG1A_CGA4_POSN                         equ 0004h
ADCG1A_CGA4_POSITION                     equ 0004h
ADCG1A_CGA4_SIZE                         equ 0001h
ADCG1A_CGA4_LENGTH                       equ 0001h
ADCG1A_CGA4_MASK                         equ 0010h
ADCG1A_CGA5_POSN                         equ 0005h
ADCG1A_CGA5_POSITION                     equ 0005h
ADCG1A_CGA5_SIZE                         equ 0001h
ADCG1A_CGA5_LENGTH                       equ 0001h
ADCG1A_CGA5_MASK                         equ 0020h
ADCG1A_CGA6_POSN                         equ 0006h
ADCG1A_CGA6_POSITION                     equ 0006h
ADCG1A_CGA6_SIZE                         equ 0001h
ADCG1A_CGA6_LENGTH                       equ 0001h
ADCG1A_CGA6_MASK                         equ 0040h
ADCG1A_CGA7_POSN                         equ 0007h
ADCG1A_CGA7_POSITION                     equ 0007h
ADCG1A_CGA7_SIZE                         equ 0001h
ADCG1A_CGA7_LENGTH                       equ 0001h
ADCG1A_CGA7_MASK                         equ 0080h

// Register: ADCG1B
#define ADCG1B ADCG1B
ADCG1B                                   equ 0111h
// bitfield definitions
ADCG1B_CGB0_POSN                         equ 0000h
ADCG1B_CGB0_POSITION                     equ 0000h
ADCG1B_CGB0_SIZE                         equ 0001h
ADCG1B_CGB0_LENGTH                       equ 0001h
ADCG1B_CGB0_MASK                         equ 0001h
ADCG1B_CGB1_POSN                         equ 0001h
ADCG1B_CGB1_POSITION                     equ 0001h
ADCG1B_CGB1_SIZE                         equ 0001h
ADCG1B_CGB1_LENGTH                       equ 0001h
ADCG1B_CGB1_MASK                         equ 0002h
ADCG1B_CGB2_POSN                         equ 0002h
ADCG1B_CGB2_POSITION                     equ 0002h
ADCG1B_CGB2_SIZE                         equ 0001h
ADCG1B_CGB2_LENGTH                       equ 0001h
ADCG1B_CGB2_MASK                         equ 0004h
ADCG1B_CGB3_POSN                         equ 0003h
ADCG1B_CGB3_POSITION                     equ 0003h
ADCG1B_CGB3_SIZE                         equ 0001h
ADCG1B_CGB3_LENGTH                       equ 0001h
ADCG1B_CGB3_MASK                         equ 0008h
ADCG1B_CGB4_POSN                         equ 0004h
ADCG1B_CGB4_POSITION                     equ 0004h
ADCG1B_CGB4_SIZE                         equ 0001h
ADCG1B_CGB4_LENGTH                       equ 0001h
ADCG1B_CGB4_MASK                         equ 0010h
ADCG1B_CGB5_POSN                         equ 0005h
ADCG1B_CGB5_POSITION                     equ 0005h
ADCG1B_CGB5_SIZE                         equ 0001h
ADCG1B_CGB5_LENGTH                       equ 0001h
ADCG1B_CGB5_MASK                         equ 0020h
ADCG1B_CGB6_POSN                         equ 0006h
ADCG1B_CGB6_POSITION                     equ 0006h
ADCG1B_CGB6_SIZE                         equ 0001h
ADCG1B_CGB6_LENGTH                       equ 0001h
ADCG1B_CGB6_MASK                         equ 0040h
ADCG1B_CGB7_POSN                         equ 0007h
ADCG1B_CGB7_POSITION                     equ 0007h
ADCG1B_CGB7_SIZE                         equ 0001h
ADCG1B_CGB7_LENGTH                       equ 0001h
ADCG1B_CGB7_MASK                         equ 0080h

// Register: ADCG1C
#define ADCG1C ADCG1C
ADCG1C                                   equ 0112h
// bitfield definitions
ADCG1C_CGC0_POSN                         equ 0000h
ADCG1C_CGC0_POSITION                     equ 0000h
ADCG1C_CGC0_SIZE                         equ 0001h
ADCG1C_CGC0_LENGTH                       equ 0001h
ADCG1C_CGC0_MASK                         equ 0001h
ADCG1C_CGC1_POSN                         equ 0001h
ADCG1C_CGC1_POSITION                     equ 0001h
ADCG1C_CGC1_SIZE                         equ 0001h
ADCG1C_CGC1_LENGTH                       equ 0001h
ADCG1C_CGC1_MASK                         equ 0002h
ADCG1C_CGC2_POSN                         equ 0002h
ADCG1C_CGC2_POSITION                     equ 0002h
ADCG1C_CGC2_SIZE                         equ 0001h
ADCG1C_CGC2_LENGTH                       equ 0001h
ADCG1C_CGC2_MASK                         equ 0004h

// Register: ADCG1E
#define ADCG1E ADCG1E
ADCG1E                                   equ 0114h
// bitfield definitions
ADCG1E_CGE0_POSN                         equ 0000h
ADCG1E_CGE0_POSITION                     equ 0000h
ADCG1E_CGE0_SIZE                         equ 0001h
ADCG1E_CGE0_LENGTH                       equ 0001h
ADCG1E_CGE0_MASK                         equ 0001h
ADCG1E_CGE1_POSN                         equ 0001h
ADCG1E_CGE1_POSITION                     equ 0001h
ADCG1E_CGE1_SIZE                         equ 0001h
ADCG1E_CGE1_LENGTH                       equ 0001h
ADCG1E_CGE1_MASK                         equ 0002h
ADCG1E_CGE2_POSN                         equ 0002h
ADCG1E_CGE2_POSITION                     equ 0002h
ADCG1E_CGE2_SIZE                         equ 0001h
ADCG1E_CGE2_LENGTH                       equ 0001h
ADCG1E_CGE2_MASK                         equ 0004h

