garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f46q24.inc
// Register: I2C2CON2
#define I2C2CON2 I2C2CON2
I2C2CON2                                 equ 02ABh
// bitfield definitions
I2C2CON2_BFRET_POSN                      equ 0000h
I2C2CON2_BFRET_POSITION                  equ 0000h
I2C2CON2_BFRET_SIZE                      equ 0002h
I2C2CON2_BFRET_LENGTH                    equ 0002h
I2C2CON2_BFRET_MASK                      equ 0003h
I2C2CON2_SDAHT_POSN                      equ 0002h
I2C2CON2_SDAHT_POSITION                  equ 0002h
I2C2CON2_SDAHT_SIZE                      equ 0002h
I2C2CON2_SDAHT_LENGTH                    equ 0002h
I2C2CON2_SDAHT_MASK                      equ 000Ch
I2C2CON2_ABD_POSN                        equ 0004h
I2C2CON2_ABD_POSITION                    equ 0004h
I2C2CON2_ABD_SIZE                        equ 0001h
I2C2CON2_ABD_LENGTH                      equ 0001h
I2C2CON2_ABD_MASK                        equ 0010h
I2C2CON2_GCEN_POSN                       equ 0006h
I2C2CON2_GCEN_POSITION                   equ 0006h
I2C2CON2_GCEN_SIZE                       equ 0001h
I2C2CON2_GCEN_LENGTH                     equ 0001h
I2C2CON2_GCEN_MASK                       equ 0040h
I2C2CON2_ACNT_POSN                       equ 0007h
I2C2CON2_ACNT_POSITION                   equ 0007h
I2C2CON2_ACNT_SIZE                       equ 0001h
I2C2CON2_ACNT_LENGTH                     equ 0001h
I2C2CON2_ACNT_MASK                       equ 0080h
I2C2CON2_BFRET0_POSN                     equ 0000h
I2C2CON2_BFRET0_POSITION                 equ 0000h
I2C2CON2_BFRET0_SIZE                     equ 0001h
I2C2CON2_BFRET0_LENGTH                   equ 0001h
I2C2CON2_BFRET0_MASK                     equ 0001h
I2C2CON2_BFRET1_POSN                     equ 0001h
I2C2CON2_BFRET1_POSITION                 equ 0001h
I2C2CON2_BFRET1_SIZE                     equ 0001h
I2C2CON2_BFRET1_LENGTH                   equ 0001h
I2C2CON2_BFRET1_MASK                     equ 0002h
I2C2CON2_SDAHT0_POSN                     equ 0002h
I2C2CON2_SDAHT0_POSITION                 equ 0002h
I2C2CON2_SDAHT0_SIZE                     equ 0001h
I2C2CON2_SDAHT0_LENGTH                   equ 0001h
I2C2CON2_SDAHT0_MASK                     equ 0004h
I2C2CON2_SDAHT1_POSN                     equ 0003h
I2C2CON2_SDAHT1_POSITION                 equ 0003h
I2C2CON2_SDAHT1_SIZE                     equ 0001h
I2C2CON2_SDAHT1_LENGTH                   equ 0001h
I2C2CON2_SDAHT1_MASK                     equ 0008h

// Register: I2C2CON3
#define I2C2CON3 I2C2CON3
I2C2CON3                                 equ 02ACh
// bitfield definitions
I2C2CON3_ACNTMD_POSN                     equ 0000h
I2C2CON3_ACNTMD_POSITION                 equ 0000h
I2C2CON3_ACNTMD_SIZE                     equ 0002h
I2C2CON3_ACNTMD_LENGTH                   equ 0002h
I2C2CON3_ACNTMD_MASK                     equ 0003h
I2C2CON3_FME_POSN                        equ 0002h
I2C2CON3_FME_POSITION                    equ 0002h
I2C2CON3_FME_SIZE                        equ 0002h
I2C2CON3_FME_LENGTH                      equ 0002h
I2C2CON3_FME_MASK                        equ 000Ch
I2C2CON3_ACNTMD0_POSN                    equ 0000h
I2C2CON3_ACNTMD0_POSITION                equ 0000h
I2C2CON3_ACNTMD0_SIZE                    equ 0001h
I2C2CON3_ACNTMD0_LENGTH                  equ 0001h
I2C2CON3_ACNTMD0_MASK                    equ 0001h
I2C2CON3_ACNTMD1_POSN                    equ 0001h
I2C2CON3_ACNTMD1_POSITION                equ 0001h
I2C2CON3_ACNTMD1_SIZE                    equ 0001h
I2C2CON3_ACNTMD1_LENGTH                  equ 0001h
I2C2CON3_ACNTMD1_MASK                    equ 0002h
I2C2CON3_FME0_POSN                       equ 0002h
I2C2CON3_FME0_POSITION                   equ 0002h
I2C2CON3_FME0_SIZE                       equ 0001h
I2C2CON3_FME0_LENGTH                     equ 0001h
I2C2CON3_FME0_MASK                       equ 0004h
I2C2CON3_FME1_POSN                       equ 0003h
I2C2CON3_FME1_POSITION                   equ 0003h
I2C2CON3_FME1_SIZE                       equ 0001h
I2C2CON3_FME1_LENGTH                     equ 0001h
I2C2CON3_FME1_MASK                       equ 0008h

// Register: I2C2ERR
#define I2C2ERR I2C2ERR
I2C2ERR                                  equ 02ADh
// bitfield definitions
I2C2ERR_NACKIE_POSN                      equ 0000h
I2C2ERR_NACKIE_POSITION                  equ 0000h
I2C2ERR_NACKIE_SIZE                      equ 0001h
I2C2ERR_NACKIE_LENGTH                    equ 0001h
I2C2ERR_NACKIE_MASK                      equ 0001h
I2C2ERR_BCLIE_POSN                       equ 0001h
I2C2ERR_BCLIE_POSITION                   equ 0001h
I2C2ERR_BCLIE_SIZE                       equ 0001h
I2C2ERR_BCLIE_LENGTH                     equ 0001h
I2C2ERR_BCLIE_MASK                       equ 0002h
I2C2ERR_BTOIE_POSN                       equ 0002h
I2C2ERR_BTOIE_POSITION                   equ 0002h
I2C2ERR_BTOIE_SIZE                       equ 0001h
I2C2ERR_BTOIE_LENGTH                     equ 0001h
I2C2ERR_BTOIE_MASK                       equ 0004h
I2C2ERR_NACKIF_POSN                      equ 0004h
I2C2ERR_NACKIF_POSITION                  equ 0004h
I2C2ERR_NACKIF_SIZE                      equ 0001h
I2C2ERR_NACKIF_LENGTH                    equ 0001h
I2C2ERR_NACKIF_MASK                      equ 0010h
I2C2ERR_BCLIF_POSN                       equ 0005h
I2C2ERR_BCLIF_POSITION                   equ 0005h
I2C2ERR_BCLIF_SIZE                       equ 0001h
I2C2ERR_BCLIF_LENGTH                     equ 0001h
I2C2ERR_BCLIF_MASK                       equ 0020h
I2C2ERR_BTOIF_POSN                       equ 0006h
I2C2ERR_BTOIF_POSITION                   equ 0006h
I2C2ERR_BTOIF_SIZE                       equ 0001h
I2C2ERR_BTOIF_LENGTH                     equ 0001h
I2C2ERR_BTOIF_MASK                       equ 0040h
I2C2ERR_NACK2IE_POSN                     equ 0000h
I2C2ERR_NACK2IE_POSITION                 equ 0000h
I2C2ERR_NACK2IE_SIZE                     equ 0001h
I2C2ERR_NACK2IE_LENGTH                   equ 0001h
I2C2ERR_NACK2IE_MASK                     equ 0001h
I2C2ERR_BCL2IE_POSN                      equ 0001h
I2C2ERR_BCL2IE_POSITION                  equ 0001h
I2C2ERR_BCL2IE_SIZE                      equ 0001h
I2C2ERR_BCL2IE_LENGTH                    equ 0001h
I2C2ERR_BCL2IE_MASK                      equ 0002h
I2C2ERR_BTO2IE_POSN                      equ 0002h
I2C2ERR_BTO2IE_POSITION                  equ 0002h
I2C2ERR_BTO2IE_SIZE                      equ 0001h
I2C2ERR_BTO2IE_LENGTH                    equ 0001h
I2C2ERR_BTO2IE_MASK                      equ 0004h
I2C2ERR_NACK2IF_POSN                     equ 0004h
I2C2ERR_NACK2IF_POSITION                 equ 0004h
I2C2ERR_NACK2IF_SIZE                     equ 0001h
I2C2ERR_NACK2IF_LENGTH                   equ 0001h
I2C2ERR_NACK2IF_MASK                     equ 0010h
I2C2ERR_BCL2IF_POSN                      equ 0005h
I2C2ERR_BCL2IF_POSITION                  equ 0005h
I2C2ERR_BCL2IF_SIZE                      equ 0001h
I2C2ERR_BCL2IF_LENGTH                    equ 0001h
I2C2ERR_BCL2IF_MASK                      equ 0020h
I2C2ERR_BTO2IF_POSN                      equ 0006h
I2C2ERR_BTO2IF_POSITION                  equ 0006h
I2C2ERR_BTO2IF_SIZE                      equ 0001h
I2C2ERR_BTO2IF_LENGTH                    equ 0001h
I2C2ERR_BTO2IF_MASK                      equ 0040h

