garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f46q24.inc
// Register: TMR3L
#define TMR3L TMR3L
TMR3L                                    equ 0323h
// bitfield definitions
TMR3L_TMR3L_POSN                         equ 0000h
TMR3L_TMR3L_POSITION                     equ 0000h
TMR3L_TMR3L_SIZE                         equ 0008h
TMR3L_TMR3L_LENGTH                       equ 0008h
TMR3L_TMR3L_MASK                         equ 00FFh
TMR3L_TMR3L0_POSN                        equ 0000h
TMR3L_TMR3L0_POSITION                    equ 0000h
TMR3L_TMR3L0_SIZE                        equ 0001h
TMR3L_TMR3L0_LENGTH                      equ 0001h
TMR3L_TMR3L0_MASK                        equ 0001h
TMR3L_TMR3L1_POSN                        equ 0001h
TMR3L_TMR3L1_POSITION                    equ 0001h
TMR3L_TMR3L1_SIZE                        equ 0001h
TMR3L_TMR3L1_LENGTH                      equ 0001h
TMR3L_TMR3L1_MASK                        equ 0002h
TMR3L_TMR3L2_POSN                        equ 0002h
TMR3L_TMR3L2_POSITION                    equ 0002h
TMR3L_TMR3L2_SIZE                        equ 0001h
TMR3L_TMR3L2_LENGTH                      equ 0001h
TMR3L_TMR3L2_MASK                        equ 0004h
TMR3L_TMR3L3_POSN                        equ 0003h
TMR3L_TMR3L3_POSITION                    equ 0003h
TMR3L_TMR3L3_SIZE                        equ 0001h
TMR3L_TMR3L3_LENGTH                      equ 0001h
TMR3L_TMR3L3_MASK                        equ 0008h
TMR3L_TMR3L4_POSN                        equ 0004h
TMR3L_TMR3L4_POSITION                    equ 0004h
TMR3L_TMR3L4_SIZE                        equ 0001h
TMR3L_TMR3L4_LENGTH                      equ 0001h
TMR3L_TMR3L4_MASK                        equ 0010h
TMR3L_TMR3L5_POSN                        equ 0005h
TMR3L_TMR3L5_POSITION                    equ 0005h
TMR3L_TMR3L5_SIZE                        equ 0001h
TMR3L_TMR3L5_LENGTH                      equ 0001h
TMR3L_TMR3L5_MASK                        equ 0020h
TMR3L_TMR3L6_POSN                        equ 0006h
TMR3L_TMR3L6_POSITION                    equ 0006h
TMR3L_TMR3L6_SIZE                        equ 0001h
TMR3L_TMR3L6_LENGTH                      equ 0001h
TMR3L_TMR3L6_MASK                        equ 0040h
TMR3L_TMR3L7_POSN                        equ 0007h
TMR3L_TMR3L7_POSITION                    equ 0007h
TMR3L_TMR3L7_SIZE                        equ 0001h
TMR3L_TMR3L7_LENGTH                      equ 0001h
TMR3L_TMR3L7_MASK                        equ 0080h
TMR3L_TMR30_POSN                         equ 0000h
TMR3L_TMR30_POSITION                     equ 0000h
TMR3L_TMR30_SIZE                         equ 0001h
TMR3L_TMR30_LENGTH                       equ 0001h
TMR3L_TMR30_MASK                         equ 0001h
TMR3L_TMR31_POSN                         equ 0001h
TMR3L_TMR31_POSITION                     equ 0001h
TMR3L_TMR31_SIZE                         equ 0001h
TMR3L_TMR31_LENGTH                       equ 0001h
TMR3L_TMR31_MASK                         equ 0002h
TMR3L_TMR32_POSN                         equ 0002h
TMR3L_TMR32_POSITION                     equ 0002h
TMR3L_TMR32_SIZE                         equ 0001h
TMR3L_TMR32_LENGTH                       equ 0001h
TMR3L_TMR32_MASK                         equ 0004h
TMR3L_TMR33_POSN                         equ 0003h
TMR3L_TMR33_POSITION                     equ 0003h
TMR3L_TMR33_SIZE                         equ 0001h
TMR3L_TMR33_LENGTH                       equ 0001h
TMR3L_TMR33_MASK                         equ 0008h
TMR3L_TMR34_POSN                         equ 0004h
TMR3L_TMR34_POSITION                     equ 0004h
TMR3L_TMR34_SIZE                         equ 0001h
TMR3L_TMR34_LENGTH                       equ 0001h
TMR3L_TMR34_MASK                         equ 0010h
TMR3L_TMR35_POSN                         equ 0005h
TMR3L_TMR35_POSITION                     equ 0005h
TMR3L_TMR35_SIZE                         equ 0001h
TMR3L_TMR35_LENGTH                       equ 0001h
TMR3L_TMR35_MASK                         equ 0020h
TMR3L_TMR36_POSN                         equ 0006h
TMR3L_TMR36_POSITION                     equ 0006h
TMR3L_TMR36_SIZE                         equ 0001h
TMR3L_TMR36_LENGTH                       equ 0001h
TMR3L_TMR36_MASK                         equ 0040h
TMR3L_TMR37_POSN                         equ 0007h
TMR3L_TMR37_POSITION                     equ 0007h
TMR3L_TMR37_SIZE                         equ 0001h
TMR3L_TMR37_LENGTH                       equ 0001h
TMR3L_TMR37_MASK                         equ 0080h

// Register: TMR3H
#define TMR3H TMR3H
TMR3H                                    equ 0324h
// bitfield definitions
TMR3H_TMR3H_POSN                         equ 0000h
TMR3H_TMR3H_POSITION                     equ 0000h
TMR3H_TMR3H_SIZE                         equ 0008h
TMR3H_TMR3H_LENGTH                       equ 0008h
TMR3H_TMR3H_MASK                         equ 00FFh
TMR3H_TMR3H0_POSN                        equ 0000h
TMR3H_TMR3H0_POSITION                    equ 0000h
TMR3H_TMR3H0_SIZE                        equ 0001h
TMR3H_TMR3H0_LENGTH                      equ 0001h
TMR3H_TMR3H0_MASK                        equ 0001h
TMR3H_TMR3H1_POSN                        equ 0001h
TMR3H_TMR3H1_POSITION                    equ 0001h
TMR3H_TMR3H1_SIZE                        equ 0001h
TMR3H_TMR3H1_LENGTH                      equ 0001h
TMR3H_TMR3H1_MASK                        equ 0002h
TMR3H_TMR3H2_POSN                        equ 0002h
TMR3H_TMR3H2_POSITION                    equ 0002h
TMR3H_TMR3H2_SIZE                        equ 0001h
TMR3H_TMR3H2_LENGTH                      equ 0001h
TMR3H_TMR3H2_MASK                        equ 0004h
TMR3H_TMR3H3_POSN                        equ 0003h
TMR3H_TMR3H3_POSITION                    equ 0003h
TMR3H_TMR3H3_SIZE                        equ 0001h
TMR3H_TMR3H3_LENGTH                      equ 0001h
TMR3H_TMR3H3_MASK                        equ 0008h
TMR3H_TMR3H4_POSN                        equ 0004h
TMR3H_TMR3H4_POSITION                    equ 0004h
TMR3H_TMR3H4_SIZE                        equ 0001h
TMR3H_TMR3H4_LENGTH                      equ 0001h
TMR3H_TMR3H4_MASK                        equ 0010h
TMR3H_TMR3H5_POSN                        equ 0005h
TMR3H_TMR3H5_POSITION                    equ 0005h
TMR3H_TMR3H5_SIZE                        equ 0001h
TMR3H_TMR3H5_LENGTH                      equ 0001h
TMR3H_TMR3H5_MASK                        equ 0020h
TMR3H_TMR3H6_POSN                        equ 0006h
TMR3H_TMR3H6_POSITION                    equ 0006h
TMR3H_TMR3H6_SIZE                        equ 0001h
TMR3H_TMR3H6_LENGTH                      equ 0001h
TMR3H_TMR3H6_MASK                        equ 0040h
TMR3H_TMR3H7_POSN                        equ 0007h
TMR3H_TMR3H7_POSITION                    equ 0007h
TMR3H_TMR3H7_SIZE                        equ 0001h
TMR3H_TMR3H7_LENGTH                      equ 0001h
TMR3H_TMR3H7_MASK                        equ 0080h
TMR3H_TMR38_POSN                         equ 0000h
TMR3H_TMR38_POSITION                     equ 0000h
TMR3H_TMR38_SIZE                         equ 0001h
TMR3H_TMR38_LENGTH                       equ 0001h
TMR3H_TMR38_MASK                         equ 0001h
TMR3H_TMR39_POSN                         equ 0001h
TMR3H_TMR39_POSITION                     equ 0001h
TMR3H_TMR39_SIZE                         equ 0001h
TMR3H_TMR39_LENGTH                       equ 0001h
TMR3H_TMR39_MASK                         equ 0002h
TMR3H_TMR310_POSN                        equ 0002h
TMR3H_TMR310_POSITION                    equ 0002h
TMR3H_TMR310_SIZE                        equ 0001h
TMR3H_TMR310_LENGTH                      equ 0001h
TMR3H_TMR310_MASK                        equ 0004h
TMR3H_TMR311_POSN                        equ 0003h
TMR3H_TMR311_POSITION                    equ 0003h
TMR3H_TMR311_SIZE                        equ 0001h
TMR3H_TMR311_LENGTH                      equ 0001h
TMR3H_TMR311_MASK                        equ 0008h
TMR3H_TMR312_POSN                        equ 0004h
TMR3H_TMR312_POSITION                    equ 0004h
TMR3H_TMR312_SIZE                        equ 0001h
TMR3H_TMR312_LENGTH                      equ 0001h
TMR3H_TMR312_MASK                        equ 0010h
TMR3H_TMR313_POSN                        equ 0005h
TMR3H_TMR313_POSITION                    equ 0005h
TMR3H_TMR313_SIZE                        equ 0001h
TMR3H_TMR313_LENGTH                      equ 0001h
TMR3H_TMR313_MASK                        equ 0020h
TMR3H_TMR314_POSN                        equ 0006h
TMR3H_TMR314_POSITION                    equ 0006h
TMR3H_TMR314_SIZE                        equ 0001h
TMR3H_TMR314_LENGTH                      equ 0001h
TMR3H_TMR314_MASK                        equ 0040h
TMR3H_TMR315_POSN                        equ 0007h
TMR3H_TMR315_POSITION                    equ 0007h
TMR3H_TMR315_SIZE                        equ 0001h
TMR3H_TMR315_LENGTH                      equ 0001h
TMR3H_TMR315_MASK                        equ 0080h

// Register: T3CON
#define T3CON T3CON
T3CON                                    equ 0325h
// bitfield definitions
T3CON_ON_POSN                            equ 0000h
T3CON_ON_POSITION                        equ 0000h
T3CON_ON_SIZE                            equ 0001h
T3CON_ON_LENGTH                          equ 0001h
T3CON_ON_MASK                            equ 0001h
T3CON_RD16_POSN                          equ 0001h
T3CON_RD16_POSITION                      equ 0001h
T3CON_RD16_SIZE                          equ 0001h
T3CON_RD16_LENGTH                        equ 0001h
T3CON_RD16_MASK                          equ 0002h
T3CON_NOT_SYNC_POSN                      equ 0002h
T3CON_NOT_SYNC_POSITION                  equ 0002h
T3CON_NOT_SYNC_SIZE                      equ 0001h
T3CON_NOT_SYNC_LENGTH                    equ 0001h
T3CON_NOT_SYNC_MASK                      equ 0004h
T3CON_CKPS_POSN                          equ 0004h
T3CON_CKPS_POSITION                      equ 0004h
T3CON_CKPS_SIZE                          equ 0002h
T3CON_CKPS_LENGTH                        equ 0002h
T3CON_CKPS_MASK                          equ 0030h
T3CON_TMR3ON_POSN                        equ 0000h
T3CON_TMR3ON_POSITION                    equ 0000h
T3CON_TMR3ON_SIZE                        equ 0001h
T3CON_TMR3ON_LENGTH                      equ 0001h
T3CON_TMR3ON_MASK                        equ 0001h
T3CON_T3RD16_POSN                        equ 0001h
T3CON_T3RD16_POSITION                    equ 0001h
T3CON_T3RD16_SIZE                        equ 0001h
T3CON_T3RD16_LENGTH                      equ 0001h
T3CON_T3RD16_MASK                        equ 0002h
T3CON_NOT_T3SYNC_POSN                    equ 0002h
T3CON_NOT_T3SYNC_POSITION                equ 0002h
T3CON_NOT_T3SYNC_SIZE                    equ 0001h
T3CON_NOT_T3SYNC_LENGTH                  equ 0001h
T3CON_NOT_T3SYNC_MASK                    equ 0004h
T3CON_T3CKPS0_POSN                       equ 0004h
T3CON_T3CKPS0_POSITION                   equ 0004h
T3CON_T3CKPS0_SIZE                       equ 0001h
T3CON_T3CKPS0_LENGTH                     equ 0001h
T3CON_T3CKPS0_MASK                       equ 0010h
T3CON_T3CKPS1_POSN                       equ 0005h
T3CON_T3CKPS1_POSITION                   equ 0005h
T3CON_T3CKPS1_SIZE                       equ 0001h
T3CON_T3CKPS1_LENGTH                     equ 0001h
T3CON_T3CKPS1_MASK                       equ 0020h
T3CON_nSYNC_POSN                         equ 0002h
T3CON_nSYNC_POSITION                     equ 0002h
T3CON_nSYNC_SIZE                         equ 0001h
T3CON_nSYNC_LENGTH                       equ 0001h
T3CON_nSYNC_MASK                         equ 0004h
T3CON_CKPS0_POSN                         equ 0004h
T3CON_CKPS0_POSITION                     equ 0004h
T3CON_CKPS0_SIZE                         equ 0001h
T3CON_CKPS0_LENGTH                       equ 0001h
T3CON_CKPS0_MASK                         equ 0010h
T3CON_CKPS1_POSN                         equ 0005h
T3CON_CKPS1_POSITION                     equ 0005h
T3CON_CKPS1_SIZE                         equ 0001h
T3CON_CKPS1_LENGTH                       equ 0001h
T3CON_CKPS1_MASK                         equ 0020h
T3CON_RD163_POSN                         equ 0001h
T3CON_RD163_POSITION                     equ 0001h
T3CON_RD163_SIZE                         equ 0001h
T3CON_RD163_LENGTH                       equ 0001h
T3CON_RD163_MASK                         equ 0002h
T3CON_nT3SYNC_POSN                       equ 0002h
T3CON_nT3SYNC_POSITION                   equ 0002h
T3CON_nT3SYNC_SIZE                       equ 0001h
T3CON_nT3SYNC_LENGTH                     equ 0001h
T3CON_nT3SYNC_MASK                       equ 0004h

// Register: T3GCON
#define T3GCON T3GCON
T3GCON                                   equ 0326h
// bitfield definitions
T3GCON_GVAL_POSN                         equ 0002h
T3GCON_GVAL_POSITION                     equ 0002h
T3GCON_GVAL_SIZE                         equ 0001h
T3GCON_GVAL_LENGTH                       equ 0001h
T3GCON_GVAL_MASK                         equ 0004h
T3GCON_GGO_POSN                          equ 0003h
T3GCON_GGO_POSITION                      equ 0003h
T3GCON_GGO_SIZE                          equ 0001h
T3GCON_GGO_LENGTH                        equ 0001h
T3GCON_GGO_MASK                          equ 0008h
T3GCON_GSPM_POSN                         equ 0004h
T3GCON_GSPM_POSITION                     equ 0004h
T3GCON_GSPM_SIZE                         equ 0001h
T3GCON_GSPM_LENGTH                       equ 0001h
T3GCON_GSPM_MASK                         equ 0010h
T3GCON_GTM_POSN                          equ 0005h
T3GCON_GTM_POSITION                      equ 0005h
T3GCON_GTM_SIZE                          equ 0001h
T3GCON_GTM_LENGTH                        equ 0001h
T3GCON_GTM_MASK                          equ 0020h
T3GCON_GPOL_POSN                         equ 0006h
T3GCON_GPOL_POSITION                     equ 0006h
T3GCON_GPOL_SIZE                         equ 0001h
T3GCON_GPOL_LENGTH                       equ 0001h
T3GCON_GPOL_MASK                         equ 0040h
T3GCON_GE_POSN                           equ 0007h
T3GCON_GE_POSITION                       equ 0007h
T3GCON_GE_SIZE                           equ 0001h
T3GCON_GE_LENGTH                         equ 0001h
T3GCON_GE_MASK                           equ 0080h
T3GCON_T3GVAL_POSN                       equ 0002h
T3GCON_T3GVAL_POSITION                   equ 0002h
T3GCON_T3GVAL_SIZE                       equ 0001h
T3GCON_T3GVAL_LENGTH                     equ 0001h
T3GCON_T3GVAL_MASK                       equ 0004h
T3GCON_T3GGO_POSN                        equ 0003h
T3GCON_T3GGO_POSITION                    equ 0003h
T3GCON_T3GGO_SIZE                        equ 0001h
T3GCON_T3GGO_LENGTH                      equ 0001h
T3GCON_T3GGO_MASK                        equ 0008h
T3GCON_T3GSPM_POSN                       equ 0004h
T3GCON_T3GSPM_POSITION                   equ 0004h
T3GCON_T3GSPM_SIZE                       equ 0001h
T3GCON_T3GSPM_LENGTH                     equ 0001h
T3GCON_T3GSPM_MASK                       equ 0010h
T3GCON_T3GTM_POSN                        equ 0005h
T3GCON_T3GTM_POSITION                    equ 0005h
T3GCON_T3GTM_SIZE                        equ 0001h
T3GCON_T3GTM_LENGTH                      equ 0001h
T3GCON_T3GTM_MASK                        equ 0020h
T3GCON_T3GPOL_POSN                       equ 0006h
T3GCON_T3GPOL_POSITION                   equ 0006h
T3GCON_T3GPOL_SIZE                       equ 0001h
T3GCON_T3GPOL_LENGTH                     equ 0001h
T3GCON_T3GPOL_MASK                       equ 0040h
T3GCON_T3GE_POSN                         equ 0007h
T3GCON_T3GE_POSITION                     equ 0007h
T3GCON_T3GE_SIZE                         equ 0001h
T3GCON_T3GE_LENGTH                       equ 0001h
T3GCON_T3GE_MASK                         equ 0080h
T3GCON_NOT_DONE_POSN                     equ 0003h
T3GCON_NOT_DONE_POSITION                 equ 0003h
T3GCON_NOT_DONE_SIZE                     equ 0001h
T3GCON_NOT_DONE_LENGTH                   equ 0001h
T3GCON_NOT_DONE_MASK                     equ 0008h
T3GCON_NOT_T3DONE_POSN                   equ 0003h
T3GCON_NOT_T3DONE_POSITION               equ 0003h
T3GCON_NOT_T3DONE_SIZE                   equ 0001h
T3GCON_NOT_T3DONE_LENGTH                 equ 0001h
T3GCON_NOT_T3DONE_MASK                   equ 0008h
T3GCON_GGO_NOT_DONE_POSN                 equ 0003h
T3GCON_GGO_NOT_DONE_POSITION             equ 0003h
T3GCON_GGO_NOT_DONE_SIZE                 equ 0001h
T3GCON_GGO_NOT_DONE_LENGTH               equ 0001h
T3GCON_GGO_NOT_DONE_MASK                 equ 0008h
T3GCON_GGO_nDONE_POSN                    equ 0003h
T3GCON_GGO_nDONE_POSITION                equ 0003h
T3GCON_GGO_nDONE_SIZE                    equ 0001h
T3GCON_GGO_nDONE_LENGTH                  equ 0001h
T3GCON_GGO_nDONE_MASK                    equ 0008h
T3GCON_T3GGO_NOT_DONE_POSN               equ 0003h
T3GCON_T3GGO_NOT_DONE_POSITION           equ 0003h
T3GCON_T3GGO_NOT_DONE_SIZE               equ 0001h
T3GCON_T3GGO_NOT_DONE_LENGTH             equ 0001h
T3GCON_T3GGO_NOT_DONE_MASK               equ 0008h
T3GCON_T3GGO_nDONE_POSN                  equ 0003h
T3GCON_T3GGO_nDONE_POSITION              equ 0003h
T3GCON_T3GGO_nDONE_SIZE                  equ 0001h
T3GCON_T3GGO_nDONE_LENGTH                equ 0001h
T3GCON_T3GGO_nDONE_MASK                  equ 0008h

// Register: T3GATE
#define T3GATE T3GATE
T3GATE                                   equ 0327h
// bitfield definitions
T3GATE_GSS_POSN                          equ 0000h
T3GATE_GSS_POSITION                      equ 0000h
T3GATE_GSS_SIZE                          equ 0008h
T3GATE_GSS_LENGTH                        equ 0008h
T3GATE_GSS_MASK                          equ 00FFh
T3GATE_GSS0_POSN                         equ 0000h
T3GATE_GSS0_POSITION                     equ 0000h
T3GATE_GSS0_SIZE                         equ 0001h
T3GATE_GSS0_LENGTH                       equ 0001h
T3GATE_GSS0_MASK                         equ 0001h
T3GATE_GSS1_POSN                         equ 0001h
T3GATE_GSS1_POSITION                     equ 0001h
T3GATE_GSS1_SIZE                         equ 0001h
T3GATE_GSS1_LENGTH                       equ 0001h
T3GATE_GSS1_MASK                         equ 0002h
T3GATE_GSS2_POSN                         equ 0002h
T3GATE_GSS2_POSITION                     equ 0002h
T3GATE_GSS2_SIZE                         equ 0001h
T3GATE_GSS2_LENGTH                       equ 0001h
T3GATE_GSS2_MASK                         equ 0004h
T3GATE_GSS3_POSN                         equ 0003h
T3GATE_GSS3_POSITION                     equ 0003h
T3GATE_GSS3_SIZE                         equ 0001h
T3GATE_GSS3_LENGTH                       equ 0001h
T3GATE_GSS3_MASK                         equ 0008h
T3GATE_GSS4_POSN                         equ 0004h
T3GATE_GSS4_POSITION                     equ 0004h
T3GATE_GSS4_SIZE                         equ 0001h
T3GATE_GSS4_LENGTH                       equ 0001h
T3GATE_GSS4_MASK                         equ 0010h
T3GATE_T3GSS0_POSN                       equ 0000h
T3GATE_T3GSS0_POSITION                   equ 0000h
T3GATE_T3GSS0_SIZE                       equ 0001h
T3GATE_T3GSS0_LENGTH                     equ 0001h
T3GATE_T3GSS0_MASK                       equ 0001h
T3GATE_T3GSS1_POSN                       equ 0001h
T3GATE_T3GSS1_POSITION                   equ 0001h
T3GATE_T3GSS1_SIZE                       equ 0001h
T3GATE_T3GSS1_LENGTH                     equ 0001h
T3GATE_T3GSS1_MASK                       equ 0002h
T3GATE_T3GSS2_POSN                       equ 0002h
T3GATE_T3GSS2_POSITION                   equ 0002h
T3GATE_T3GSS2_SIZE                       equ 0001h
T3GATE_T3GSS2_LENGTH                     equ 0001h
T3GATE_T3GSS2_MASK                       equ 0004h
T3GATE_T3GSS3_POSN                       equ 0003h
T3GATE_T3GSS3_POSITION                   equ 0003h
T3GATE_T3GSS3_SIZE                       equ 0001h
T3GATE_T3GSS3_LENGTH                     equ 0001h
T3GATE_T3GSS3_MASK                       equ 0008h
T3GATE_T3GSS4_POSN                       equ 0004h
T3GATE_T3GSS4_POSITION                   equ 0004h
T3GATE_T3GSS4_SIZE                       equ 0001h
T3GATE_T3GSS4_LENGTH                     equ 0001h
T3GATE_T3GSS4_MASK                       equ 0010h

// Register: T3CLK
#define T3CLK T3CLK
T3CLK                                    equ 0328h
// bitfield definitions
T3CLK_CS_POSN                            equ 0000h
T3CLK_CS_POSITION                        equ 0000h
T3CLK_CS_SIZE                            equ 0008h
T3CLK_CS_LENGTH                          equ 0008h
T3CLK_CS_MASK                            equ 00FFh
T3CLK_T3CS0_POSN                         equ 0000h
T3CLK_T3CS0_POSITION                     equ 0000h
T3CLK_T3CS0_SIZE                         equ 0001h
T3CLK_T3CS0_LENGTH                       equ 0001h
T3CLK_T3CS0_MASK                         equ 0001h
T3CLK_T3CS1_POSN                         equ 0001h
T3CLK_T3CS1_POSITION                     equ 0001h
T3CLK_T3CS1_SIZE                         equ 0001h
T3CLK_T3CS1_LENGTH                       equ 0001h
T3CLK_T3CS1_MASK                         equ 0002h
T3CLK_T3CS2_POSN                         equ 0002h
T3CLK_T3CS2_POSITION                     equ 0002h
T3CLK_T3CS2_SIZE                         equ 0001h
T3CLK_T3CS2_LENGTH                       equ 0001h
T3CLK_T3CS2_MASK                         equ 0004h
T3CLK_T3CS3_POSN                         equ 0003h
T3CLK_T3CS3_POSITION                     equ 0003h
T3CLK_T3CS3_SIZE                         equ 0001h
T3CLK_T3CS3_LENGTH                       equ 0001h
T3CLK_T3CS3_MASK                         equ 0008h
T3CLK_T3CS4_POSN                         equ 0004h
T3CLK_T3CS4_POSITION                     equ 0004h
T3CLK_T3CS4_SIZE                         equ 0001h
T3CLK_T3CS4_LENGTH                       equ 0001h
T3CLK_T3CS4_MASK                         equ 0010h
T3CLK_CS0_POSN                           equ 0000h
T3CLK_CS0_POSITION                       equ 0000h
T3CLK_CS0_SIZE                           equ 0001h
T3CLK_CS0_LENGTH                         equ 0001h
T3CLK_CS0_MASK                           equ 0001h
T3CLK_CS1_POSN                           equ 0001h
T3CLK_CS1_POSITION                       equ 0001h
T3CLK_CS1_SIZE                           equ 0001h
T3CLK_CS1_LENGTH                         equ 0001h
T3CLK_CS1_MASK                           equ 0002h
T3CLK_CS2_POSN                           equ 0002h
T3CLK_CS2_POSITION                       equ 0002h
T3CLK_CS2_SIZE                           equ 0001h
T3CLK_CS2_LENGTH                         equ 0001h
T3CLK_CS2_MASK                           equ 0004h
T3CLK_CS3_POSN                           equ 0003h
T3CLK_CS3_POSITION                       equ 0003h
T3CLK_CS3_SIZE                           equ 0001h
T3CLK_CS3_LENGTH                         equ 0001h
T3CLK_CS3_MASK                           equ 0008h
T3CLK_CS4_POSN                           equ 0004h
T3CLK_CS4_POSITION                       equ 0004h
T3CLK_CS4_SIZE                           equ 0001h
T3CLK_CS4_LENGTH                         equ 0001h
T3CLK_CS4_MASK                           equ 0010h

// Register: T4TMR
#define T4TMR T4TMR
T4TMR                                    equ 032Ah
// bitfield definitions
T4TMR_TMR4_POSN                          equ 0000h
T4TMR_TMR4_POSITION                      equ 0000h
T4TMR_TMR4_SIZE                          equ 0008h
T4TMR_TMR4_LENGTH                        equ 0008h
T4TMR_TMR4_MASK                          equ 00FFh

// Register: T4PR
#define T4PR T4PR
T4PR                                     equ 032Bh
// bitfield definitions
T4PR_PR4_POSN                            equ 0000h
T4PR_PR4_POSITION                        equ 0000h
T4PR_PR4_SIZE                            equ 0008h
T4PR_PR4_LENGTH                          equ 0008h
T4PR_PR4_MASK                            equ 00FFh

