garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f46q24.inc
// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
PWM3S1P2                                 equ 048Bh

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
PWM3S1P2L                                equ 048Bh
// bitfield definitions
PWM3S1P2L_S1P2L_POSN                     equ 0000h
PWM3S1P2L_S1P2L_POSITION                 equ 0000h
PWM3S1P2L_S1P2L_SIZE                     equ 0008h
PWM3S1P2L_S1P2L_LENGTH                   equ 0008h
PWM3S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
PWM3S1P2H                                equ 048Ch
// bitfield definitions
PWM3S1P2H_S1P2H_POSN                     equ 0000h
PWM3S1P2H_S1P2H_POSITION                 equ 0000h
PWM3S1P2H_S1P2H_SIZE                     equ 0008h
PWM3S1P2H_S1P2H_LENGTH                   equ 0008h
PWM3S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWMLOAD
#define PWMLOAD PWMLOAD
PWMLOAD                                  equ 0499h
// bitfield definitions
PWMLOAD_MPWM1LD_POSN                     equ 0000h
PWMLOAD_MPWM1LD_POSITION                 equ 0000h
PWMLOAD_MPWM1LD_SIZE                     equ 0001h
PWMLOAD_MPWM1LD_LENGTH                   equ 0001h
PWMLOAD_MPWM1LD_MASK                     equ 0001h
PWMLOAD_MPWM2LD_POSN                     equ 0001h
PWMLOAD_MPWM2LD_POSITION                 equ 0001h
PWMLOAD_MPWM2LD_SIZE                     equ 0001h
PWMLOAD_MPWM2LD_LENGTH                   equ 0001h
PWMLOAD_MPWM2LD_MASK                     equ 0002h
PWMLOAD_MPWM3LD_POSN                     equ 0002h
PWMLOAD_MPWM3LD_POSITION                 equ 0002h
PWMLOAD_MPWM3LD_SIZE                     equ 0001h
PWMLOAD_MPWM3LD_LENGTH                   equ 0001h
PWMLOAD_MPWM3LD_MASK                     equ 0004h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 049Ah
// bitfield definitions
PWMEN_MPWM1EN_POSN                       equ 0000h
PWMEN_MPWM1EN_POSITION                   equ 0000h
PWMEN_MPWM1EN_SIZE                       equ 0001h
PWMEN_MPWM1EN_LENGTH                     equ 0001h
PWMEN_MPWM1EN_MASK                       equ 0001h
PWMEN_MPWM2EN_POSN                       equ 0001h
PWMEN_MPWM2EN_POSITION                   equ 0001h
PWMEN_MPWM2EN_SIZE                       equ 0001h
PWMEN_MPWM2EN_LENGTH                     equ 0001h
PWMEN_MPWM2EN_MASK                       equ 0002h
PWMEN_MPWM3EN_POSN                       equ 0002h
PWMEN_MPWM3EN_POSITION                   equ 0002h
PWMEN_MPWM3EN_SIZE                       equ 0001h
PWMEN_MPWM3EN_LENGTH                     equ 0001h
PWMEN_MPWM3EN_MASK                       equ 0004h

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 049Eh
// bitfield definitions
IPR0_SWIP_POSN                           equ 0000h
IPR0_SWIP_POSITION                       equ 0000h
IPR0_SWIP_SIZE                           equ 0001h
IPR0_SWIP_LENGTH                         equ 0001h
IPR0_SWIP_MASK                           equ 0001h
IPR0_HLVDIP_POSN                         equ 0001h
IPR0_HLVDIP_POSITION                     equ 0001h
IPR0_HLVDIP_SIZE                         equ 0001h
IPR0_HLVDIP_LENGTH                       equ 0001h
IPR0_HLVDIP_MASK                         equ 0002h
IPR0_OSFIP_POSN                          equ 0002h
IPR0_OSFIP_POSITION                      equ 0002h
IPR0_OSFIP_SIZE                          equ 0001h
IPR0_OSFIP_LENGTH                        equ 0001h
IPR0_OSFIP_MASK                          equ 0004h
IPR0_CSWIP_POSN                          equ 0003h
IPR0_CSWIP_POSITION                      equ 0003h
IPR0_CSWIP_SIZE                          equ 0001h
IPR0_CSWIP_LENGTH                        equ 0001h
IPR0_CSWIP_MASK                          equ 0008h
IPR0_NVMIP_POSN                          equ 0004h
IPR0_NVMIP_POSITION                      equ 0004h
IPR0_NVMIP_SIZE                          equ 0001h
IPR0_NVMIP_LENGTH                        equ 0001h
IPR0_NVMIP_MASK                          equ 0010h
IPR0_CLC1IP_POSN                         equ 0005h
IPR0_CLC1IP_POSITION                     equ 0005h
IPR0_CLC1IP_SIZE                         equ 0001h
IPR0_CLC1IP_LENGTH                       equ 0001h
IPR0_CLC1IP_MASK                         equ 0020h
IPR0_CRCIP_POSN                          equ 0006h
IPR0_CRCIP_POSITION                      equ 0006h
IPR0_CRCIP_SIZE                          equ 0001h
IPR0_CRCIP_LENGTH                        equ 0001h
IPR0_CRCIP_MASK                          equ 0040h
IPR0_IOCIP_POSN                          equ 0007h
IPR0_IOCIP_POSITION                      equ 0007h
IPR0_IOCIP_SIZE                          equ 0001h
IPR0_IOCIP_LENGTH                        equ 0001h
IPR0_IOCIP_MASK                          equ 0080h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 049Fh
// bitfield definitions
IPR1_INT0IP_POSN                         equ 0000h
IPR1_INT0IP_POSITION                     equ 0000h
IPR1_INT0IP_SIZE                         equ 0001h
IPR1_INT0IP_LENGTH                       equ 0001h
IPR1_INT0IP_MASK                         equ 0001h
IPR1_ADTIP_POSN                          equ 0001h
IPR1_ADTIP_POSITION                      equ 0001h
IPR1_ADTIP_SIZE                          equ 0001h
IPR1_ADTIP_LENGTH                        equ 0001h
IPR1_ADTIP_MASK                          equ 0002h
IPR1_ADIP_POSN                           equ 0002h
IPR1_ADIP_POSITION                       equ 0002h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0004h
IPR1_ACTIP_POSN                          equ 0003h
IPR1_ACTIP_POSITION                      equ 0003h
IPR1_ACTIP_SIZE                          equ 0001h
IPR1_ACTIP_LENGTH                        equ 0001h
IPR1_ACTIP_MASK                          equ 0008h
IPR1_I2C2RXIP_POSN                       equ 0004h
IPR1_I2C2RXIP_POSITION                   equ 0004h
IPR1_I2C2RXIP_SIZE                       equ 0001h
IPR1_I2C2RXIP_LENGTH                     equ 0001h
IPR1_I2C2RXIP_MASK                       equ 0010h
IPR1_I2C2TXIP_POSN                       equ 0005h
IPR1_I2C2TXIP_POSITION                   equ 0005h
IPR1_I2C2TXIP_SIZE                       equ 0001h
IPR1_I2C2TXIP_LENGTH                     equ 0001h
IPR1_I2C2TXIP_MASK                       equ 0020h
IPR1_I2C2IP_POSN                         equ 0006h
IPR1_I2C2IP_POSITION                     equ 0006h
IPR1_I2C2IP_SIZE                         equ 0001h
IPR1_I2C2IP_LENGTH                       equ 0001h
IPR1_I2C2IP_MASK                         equ 0040h
IPR1_I2C2EIP_POSN                        equ 0007h
IPR1_I2C2EIP_POSITION                    equ 0007h
IPR1_I2C2EIP_SIZE                        equ 0001h
IPR1_I2C2EIP_LENGTH                      equ 0001h
IPR1_I2C2EIP_MASK                        equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 04A0h
// bitfield definitions
IPR2_ZCD2IP_POSN                         equ 0000h
IPR2_ZCD2IP_POSITION                     equ 0000h
IPR2_ZCD2IP_SIZE                         equ 0001h
IPR2_ZCD2IP_LENGTH                       equ 0001h
IPR2_ZCD2IP_MASK                         equ 0001h
IPR2_CLC5IP_POSN                         equ 0001h
IPR2_CLC5IP_POSITION                     equ 0001h
IPR2_CLC5IP_SIZE                         equ 0001h
IPR2_CLC5IP_LENGTH                       equ 0001h
IPR2_CLC5IP_MASK                         equ 0002h
IPR2_IOCSRIP_POSN                        equ 0002h
IPR2_IOCSRIP_POSITION                    equ 0002h
IPR2_IOCSRIP_SIZE                        equ 0001h
IPR2_IOCSRIP_LENGTH                      equ 0001h
IPR2_IOCSRIP_MASK                        equ 0004h
IPR2_ZCD1IP_POSN                         equ 0003h
IPR2_ZCD1IP_POSITION                     equ 0003h
IPR2_ZCD1IP_SIZE                         equ 0001h
IPR2_ZCD1IP_LENGTH                       equ 0001h
IPR2_ZCD1IP_MASK                         equ 0008h
IPR2_DMA1SCNTIP_POSN                     equ 0004h
IPR2_DMA1SCNTIP_POSITION                 equ 0004h
IPR2_DMA1SCNTIP_SIZE                     equ 0001h
IPR2_DMA1SCNTIP_LENGTH                   equ 0001h
IPR2_DMA1SCNTIP_MASK                     equ 0010h
IPR2_DMA1DCNTIP_POSN                     equ 0005h
IPR2_DMA1DCNTIP_POSITION                 equ 0005h
IPR2_DMA1DCNTIP_SIZE                     equ 0001h
IPR2_DMA1DCNTIP_LENGTH                   equ 0001h
IPR2_DMA1DCNTIP_MASK                     equ 0020h
IPR2_DMA1ORIP_POSN                       equ 0006h
IPR2_DMA1ORIP_POSITION                   equ 0006h
IPR2_DMA1ORIP_SIZE                       equ 0001h
IPR2_DMA1ORIP_LENGTH                     equ 0001h
IPR2_DMA1ORIP_MASK                       equ 0040h
IPR2_DMA1AIP_POSN                        equ 0007h
IPR2_DMA1AIP_POSITION                    equ 0007h
IPR2_DMA1AIP_SIZE                        equ 0001h
IPR2_DMA1AIP_LENGTH                      equ 0001h
IPR2_DMA1AIP_MASK                        equ 0080h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 04A1h
// bitfield definitions
IPR3_SPI1RXIP_POSN                       equ 0000h
IPR3_SPI1RXIP_POSITION                   equ 0000h
IPR3_SPI1RXIP_SIZE                       equ 0001h
IPR3_SPI1RXIP_LENGTH                     equ 0001h
IPR3_SPI1RXIP_MASK                       equ 0001h
IPR3_SPI1TXIP_POSN                       equ 0001h
IPR3_SPI1TXIP_POSITION                   equ 0001h
IPR3_SPI1TXIP_SIZE                       equ 0001h
IPR3_SPI1TXIP_LENGTH                     equ 0001h
IPR3_SPI1TXIP_MASK                       equ 0002h
IPR3_SPI1IP_POSN                         equ 0002h
IPR3_SPI1IP_POSITION                     equ 0002h
IPR3_SPI1IP_SIZE                         equ 0001h
IPR3_SPI1IP_LENGTH                       equ 0001h
IPR3_SPI1IP_MASK                         equ 0004h
IPR3_TMR2IP_POSN                         equ 0003h
IPR3_TMR2IP_POSITION                     equ 0003h
IPR3_TMR2IP_SIZE                         equ 0001h
IPR3_TMR2IP_LENGTH                       equ 0001h
IPR3_TMR2IP_MASK                         equ 0008h
IPR3_TMR1IP_POSN                         equ 0004h
IPR3_TMR1IP_POSITION                     equ 0004h
IPR3_TMR1IP_SIZE                         equ 0001h
IPR3_TMR1IP_LENGTH                       equ 0001h
IPR3_TMR1IP_MASK                         equ 0010h
IPR3_TMR1GIP_POSN                        equ 0005h
IPR3_TMR1GIP_POSITION                    equ 0005h
IPR3_TMR1GIP_SIZE                        equ 0001h
IPR3_TMR1GIP_LENGTH                      equ 0001h
IPR3_TMR1GIP_MASK                        equ 0020h
IPR3_CCP1IP_POSN                         equ 0006h
IPR3_CCP1IP_POSITION                     equ 0006h
IPR3_CCP1IP_SIZE                         equ 0001h
IPR3_CCP1IP_LENGTH                       equ 0001h
IPR3_CCP1IP_MASK                         equ 0040h
IPR3_TMR0IP_POSN                         equ 0007h
IPR3_TMR0IP_POSITION                     equ 0007h
IPR3_TMR0IP_SIZE                         equ 0001h
IPR3_TMR0IP_LENGTH                       equ 0001h
IPR3_TMR0IP_MASK                         equ 0080h

